; domain
(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block position)
  (:predicates (on ?x - block ?y - block)
           (at ?x - block ?p - position)
           (free ?p - position)
	       (ontable ?x - block)
	       (onload ?x - block)
	       (onDetection2 ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (loadfree)
	       (holding ?x - block)
	       (done)
	       )

  (:action place
	     :parameters (?x - block ?p - position)
	     :precondition (and (holding ?x) (free ?p))
	     :effect
	     (and (not (holding ?x))
		   (not (free ?p))
		   (clear ?x)
		   (handempty)
		   (at ?x ?p) (done)))
		   
  (:action load
         :parameters (?x - block)
         :precondition (and (clear ?x) (ontable ?x) (loadfree) (done))
         :effect
         (and (not (ontable ?x))
           (not (loadfree))
           (onload ?x) (not (done))))
           
  (:action moveonconveyor
         :parameters (?x - block)
         :precondition (and (onload ?x))
         :effect
         (and (loadfree)
           (onDetection2 ?x)))
	     
  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (onDetection2 ?x) (handempty))
	     :effect
	     (and (not (onDetection2 ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))
		   
  (:action pick-from-pos
	     :parameters (?x - block ?p - position)
	     :precondition (and (clear ?x) (at ?x ?p) (handempty))
	     :effect
	     (and (not (at ?x ?p))
		   (not (clear ?x))
		   (not (handempty))
		   (free ?p)
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)
		   (done)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
		   (not (done)))))

; problem
(define (problem dobot01)
(:domain BLOCKS)
(:objects cube_0 cube_1 - block
pos0 pos1 - position)
(:init (done)(HANDEMPTY) (loadfree) (free pos0)(free pos1)
(ontable cube_0)(ontable cube_1)
(clear cube_0)(clear cube_1))
(:goal (and (at cube_0 pos0) (at cube_1 pos1)))
)

; plan
1. (load cube_0)
   deleted: (ontable cube_0) (loadfree) (done)
   added: (onload cube_0)
   goals met: 0 of 2
2. (moveonconveyor cube_0)
   added: (loadfree) (ondetection2 cube_0)
   goals met: 0 of 2
3. (pick-up cube_0)
   deleted: (ondetection2 cube_0) (clear cube_0) (handempty)
   added: (holding cube_0)
   goals met: 0 of 2
4. (place cube_0 pos0)
   deleted: (holding cube_0) (free pos0)
   added: (clear cube_0) (handempty) (at cube_0 pos0) (done)
   goals met: 1 of 2
5. (load cube_1)
   deleted: (ontable cube_1) (loadfree) (done)
   added: (onload cube_1)
   goals met: 1 of 2
6. (moveonconveyor cube_1)
   added: (loadfree) (ondetection2 cube_1)
   goals met: 1 of 2
7. (pick-up cube_1)
   deleted: (ondetection2 cube_1) (clear cube_1) (handempty)
   added: (holding cube_1)
   goals met: 1 of 2
8. (place cube_1 pos1)
   deleted: (holding cube_1) (free pos1)
   added: (clear cube_1) (handempty) (at cube_1 pos1) (done)
   goals met: 2 of 2
